{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Robbie\Documents\PubPol590\Descriptives\page_stats.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Apr 2014, 15:16:37
{txt}
{com}. 
. *Page 9: Correlations of Big 5 and risk propensity
. pwcorr pers_risky add_*, sig

             {txt}{c |} pers_r~y add_ex~n add_ag~e add_co~s add_op~s add_ne~m
{hline 13}{c +}{hline 54}
  pers_risky {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
add_extrav~n {c |} {res} -0.2514   1.0000 
             {txt}{c |}{res}   0.0000
             {txt}{c |}
add_agreea~e {c |} {res}  0.0272   0.2740   1.0000 
             {txt}{c |}{res}   0.0531   0.0000
             {txt}{c |}
add_consci~s {c |} {res}  0.0574   0.0634   0.1656   1.0000 
             {txt}{c |}{res}   0.0000   0.0000   0.0000
             {txt}{c |}
add_openness {c |} {res} -0.1384   0.2226   0.2795   0.0263   1.0000 
             {txt}{c |}{res}   0.0000   0.0000   0.0000   0.0624
             {txt}{c |}
add_neurot~m {c |} {res}  0.0224  -0.0958  -0.0682  -0.1096  -0.1557   1.0000 
             {txt}{c |}{res}   0.1111   0.0000   0.0000   0.0000   0.0000
             {txt}{c |}

{com}. 
. *Page 13: Adidtive health index descriptives
. egen health_index = rowtotal(diag_* lastm_gum_disease-lastm_allergies last2w_flu-last2w_rash)
{txt}
{com}. sum health_index

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
health_index {c |}{res}      5083    1.705882    1.801836          0         14
{txt}
{com}. bys insur_cat: sum health_index

{txt}{hline}
-> insur_cat = Insured

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
health_index {c |}{res}      4017    1.692059     1.76114          0         14

{txt}{hline}
-> insur_cat = Voluntary Uninsured

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
health_index {c |}{res}       152    1.072368    1.460754          0          8

{txt}{hline}
-> insur_cat = Non-voluntary Uninsured

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
health_index {c |}{res}       910    1.875824    1.998065          0         14

{txt}{hline}
-> insur_cat = .d

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
health_index {c |}{res}         4           1    .8164966          0          2

{txt}
{com}. pwcorr health_index gen_health, sig

             {txt}{c |} health~x gen_he~h
{hline 13}{c +}{hline 18}
health_index {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
  gen_health {c |} {res} -0.2870   1.0000 
             {txt}{c |}{res}   0.0000
             {txt}{c |}

{com}. 
. *Page 14: SES, Race, and Gender
. tabstat rent_own, by(insur_cat)

{txt}Summary for variables: rent_own
{col 6}by categories of: insur_cat (RECODE of insured (RECODE of insurance_status (S5Q1 BEST DESCRIBE CURR/HEALTH IN)

{ralign 16:insur_cat} {...}
{c |}      mean
{hline 17}{c +}{hline 10}
{ralign 16:Insured} {...}
{c |}{...}
 {res} .4529148
{txt}{ralign 16:Voluntary Uninsu} {...}
{c |}{...}
 {res} .2828947
{txt}{ralign 16:Non-voluntary Un} {...}
{c |}{...}
 {res} .2461369
{txt}{hline 17}{c +}{hline 10}
{ralign 16:Total} {...}
{c |}{...}
 {res} .4108833
{txt}{hline 17}{c BT}{hline 10}

{com}. tab insur_cat noins_expensive, row nofreq

    {txt}RECODE of insured {c |}
           (RECODE of {c |}
     insurance_status {c |}   S5Q2B WHY NO HLTH
  (S5Q1 BEST DESCRIBE {c |} INS-TOO EXPENSIVE-W4
       CURR/HEALTH IN {c |}        No        Yes {c |}     Total
{hline 22}{c +}{hline 22}{c +}{hline 10}
  Voluntary Uninsured {c |}{res}     34.00      66.00 {txt}{c |}{res}    100.00 
{txt}Non-voluntary Uninsur {c |}{res}     23.65      76.35 {txt}{c |}{res}    100.00 
{txt}{hline 22}{c +}{hline 22}{c +}{hline 10}
                Total {c |}{res}     25.12      74.88 {txt}{c |}{res}    100.00 

{txt}
{com}. tab insur_cat race_hispanic, row nofreq

    {txt}RECODE of insured {c |}
           (RECODE of {c |}
     insurance_status {c |}    S1Q4 ARE YOU OF
  (S5Q1 BEST DESCRIBE {c |}  HISPANIC ORIGIN-W1
       CURR/HEALTH IN {c |}        No        Yes {c |}     Total
{hline 22}{c +}{hline 22}{c +}{hline 10}
              Insured {c |}{res}     89.72      10.28 {txt}{c |}{res}    100.00 
{txt}  Voluntary Uninsured {c |}{res}     82.67      17.33 {txt}{c |}{res}    100.00 
{txt}Non-voluntary Uninsur {c |}{res}     89.98      10.02 {txt}{c |}{res}    100.00 
{txt}{hline 22}{c +}{hline 22}{c +}{hline 10}
                Total {c |}{res}     89.56      10.44 {txt}{c |}{res}    100.00 

{txt}
{com}. tab insur_cat male, row nofreq

    {txt}RECODE of insured {c |}
           (RECODE of {c |}
     insurance_status {c |}   RECODE of gender
  (S5Q1 BEST DESCRIBE {c |}  (BIOLOGICAL SEX-W4)
       CURR/HEALTH IN {c |}    Female       Male {c |}     Total
{hline 22}{c +}{hline 22}{c +}{hline 10}
              Insured {c |}{res}     57.08      42.92 {txt}{c |}{res}    100.00 
{txt}  Voluntary Uninsured {c |}{res}     40.79      59.21 {txt}{c |}{res}    100.00 
{txt}Non-voluntary Uninsur {c |}{res}     44.18      55.82 {txt}{c |}{res}    100.00 
{txt}{hline 22}{c +}{hline 22}{c +}{hline 10}
                Total {c |}{res}     54.28      45.72 {txt}{c |}{res}    100.00 

{txt}
{com}. 
. *Page 17: Power analysis
. //ssc install powerlog
. qui logit noins_dont_want pers_risky
{txt}
{com}. sum pers_risky if insured == 0

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}pers_risky {c |}{res}      1059     3.15203    1.011523          1          5
{txt}
{com}. local mean = r(mean)
{txt}
{com}. local onedev = r(mean) + r(sd)
{txt}
{com}. prvalue, x(pers_risky=`mean') rest(mean)

{res}logit{txt}: Predictions for {res}noins_dont_want

{txt}Confidence intervals by delta method

{col 32} 95% Conf. Interval
  Pr(y=Yes|x):{res}{col 22} 0.1421{col 32}{txt}[{res} 0.1210{txt},{res}{col 44} 0.1632{txt}]
  Pr(y=No|x):{res}{col 22} 0.8579{col 32}{txt}[{res} 0.8368{txt},{res}{col 44} 0.8790{txt}]

    pers_risky
x=  {res} 3.1520302
{txt}
{com}. local atmean = r(p1)
{txt}
{com}. prvalue, x(pers_risky=`onedev') rest(mean)

{res}logit{txt}: Predictions for {res}noins_dont_want

{txt}Confidence intervals by delta method

{col 32} 95% Conf. Interval
  Pr(y=Yes|x):{res}{col 22} 0.1590{col 32}{txt}[{res} 0.1277{txt},{res}{col 44} 0.1903{txt}]
  Pr(y=No|x):{res}{col 22} 0.8410{col 32}{txt}[{res} 0.8097{txt},{res}{col 44} 0.8723{txt}]

    pers_risky
x=  {res} 4.1635532
{txt}
{com}. local atonedev = r(p1)
{txt}
{com}. powerlog, p1(`atmean') p2(`atonedev') alpha(0.05)

{txt} Logistic regression power analysis
 One-tailed test: alpha=.05  p1=.1421086  p2=.1589898  rsq=0  odds ratio=1.141247799663683

 power          n
{res} 0.60        1872
 0.65        2141
 0.70        2443
 0.75        2791
 0.80        3207
 0.85        3727
 0.90        4438
{txt}
{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Robbie\Documents\PubPol590\Descriptives\page_stats.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}21 Apr 2014, 15:16:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}